app/Filament/Resources/BuchungResource.php

select * from `leistung` where `leistung`.`id` = '5' limit 1
---
                                        ->reactive()
                                        ->afterStateUpdated(function ($state, callable $set) {
                                            if ($state) {
                                                $leistung = \App\Models\Leistung::find($state);